[MooseCheckCommandlet]
HelpDescription="Verifica certas coisas em cada pacote."
HelpUsage="gamename.exe MooseCheck <package.classname> [package.classname package.classname ...] [-switches...]"
HelpParamNames[0]="package.classname"
HelpParamDescriptions[0]="O caminho completo para a classe a procurar, por exemplo, e.g. Engine.LightComponent"
HelpParamNames[1]="-ExactClass"
HelpParamDescriptions[1]="Indica que apenas os objetos que têm essa classe devem ser contados.O comportamento padrão é também contar objetos de classes derivadas da classe especificada."
HelpParamNames[2]="-IncludeScript"
HelpParamDescriptions[2]="Indica que os pacotes que contêm unrealscript (geralmente apenas .u pacotes) devem ser pesquisados ​​também."
HelpParamNames[3]="-IncludeCooked"
HelpParamDescriptions[3]="Indica que os pacotes que foram preparados para uma plataforma de console devem ser pesquisados ​​também."
HelpParamNames[4]="-CookedOnly"
HelpParamDescriptions[4]="Indica que somente os pacotes que foram preparados para uma plataforma de console devem ser pesquisados."
HelpParamNames[5]="-SkipClientOnly"
HelpParamDescriptions[5]="Indica que todos os objetos que são configurados apenas para carregar somente no cliente devem ser ignorados."
HelpParamNames[6]="-SkipServerOnly"
HelpParamDescriptions[6]="Indica que todos os objetos que são configurados apenas para carregar somente no servidor devem ser ignorados."
HelpParamNames[7]="-SkipEditorOnly"
HelpParamDescriptions[7]="Indica que todos os objetos que são configurados apenas para carregar apenas no editor devem ser ignorados."
HelpParamNames[8]="-IgnoreWriteable"
HelpParamDescriptions[8]="Indica que somente os pacotes de somente leitura devem ser verificados (útil para evitar pacotes de teste antigos que podem falhar o comando)"
HelpParamNames[9]="-IgnoreMaps"
HelpParamDescriptions[9]="Indica que os pacakges de mapas devem ser ignorados (acelera a execução quando o objeto que você deseja listar não puder ser colocado em mapas)"
HelpParamNames[10]="-ObjectNames"
HelpParamDescriptions[10]="Exibe o nome completo do caminho para todos os objetos encontrados pelo comando"
HelpParamNames[11]="-AllowNonVignettes"
HelpParamDescriptions[11]="Verifica mapas não vignette"
HelpParamNames[12]="-DontCheckDynamicLights"
HelpParamDescriptions[12]=""Ignorar a verificação de luzes dinâmicas"
